Revit 2024 API
SpecTypeId.Reference.FillPattern Property
 Fill Pattern, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FillPattern { get; }
Visual Basic
Public Shared ReadOnly Property FillPattern As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FillPattern {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace